app/views/trip_reports/_form.html.erb

    <div class="controls">
      <%= collection_select :trip_report, :driver_id, Driver.order("first_name"), :id, :first_and_last_name %>
---
SELECT "drivers".* FROM "drivers" ORDER BY first_name