app/views/trip_reports/index.html.erb

SELECT "drivers".* FROM "drivers" WHERE "drivers"."id" = 1 LIMIT 1
---
        <td><%= link_to trip_report.id, trip_report_path(trip_report) %></td>
        <td><%= trip_report.driver.first_and_last_name %></td>