app/controllers/drivers_controller.rb

SELECT "drivers".* FROM "drivers" ORDER BY last_name
---
  def index
    @drivers = Driver.order("last_name")

SELECT "drivers".* FROM "drivers" WHERE "drivers"."id" = ? LIMIT 1  [["id", "3"]]
---
  def show
    @driver = Driver.find(params[:id])