app/controllers/trip_reports_controller.rb

  def index
    @trip_reports = TripReport.all
---
SELECT "trip_reports".* FROM "trip_reports" ORDER BY trip_start_date

  def show
    @trip_report = TripReport.find(params[:id])
---
SELECT "trip_reports".* FROM "trip_reports" WHERE "trip_reports"."id" = ? LIMIT 1  [["id", "10"]]